NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/access/src/device_state_manager.c
typedef enum
{
    DSM_ADDRESS_ROLE_SUBSCRIBE,
    DSM_ADDRESS_ROLE_PUBLISH
} dsm_address_role_t;

typedef enum
{
    DSM_ENTRY_TYPE_LOCAL_UNICAST,
    DSM_ENTRY_TYPE_ADDR_NONVIRTUAL,
    DSM_ENTRY_TYPE_ADDR_VIRTUAL,
    DSM_ENTRY_TYPE_SUBNET,
    DSM_ENTRY_TYPE_APPKEY,
    DSM_ENTRY_TYPE_DEVKEY,
    DSM_ENTRY_TYPES
} dsm_entry_type_t;

#if PERSISTENT_STORAGE

/* Callback function for converting a DSM entry into a flash entry. */
typedef void (*dsm_entry_to_flash_entry_t)(uint32_t index, dsm_flash_entry_t * p_dst, uint16_t * p_entry_len);
/* Callback function for converting a flash entry into a DSM entry. */
typedef void (*flash_entry_to_dsm_entry_t)(uint32_t index, const dsm_flash_entry_t * p_src, uint16_t entry_len);

typedef struct
{
    uint32_t entry_count;
    uint32_t * p_allocated_bitfield;
    uint32_t * p_needs_flashing_bitfield;
    fm_handle_t flash_start_handle;
    uint32_t flash_entry_data_size;
    dsm_entry_to_flash_entry_t to_flash_entry;
    flash_entry_to_dsm_entry_t to_dsm_entry;
} flash_group_t;

typedef enum
{
    FLASH_STATE_READY,
    FLASH_STATE_WAITING_FOR_MEMORY,
    FLASH_STATE_REMOVING,
    FLASH_STATE_REMOVED,
    FLASH_STATE_REBUILDING
} flash_state_t;
#endif /* PERSISTENT_STORAGE */

/*****************************************************************************
* Static globals
*****************************************************************************/
/** Virtual addresses */
static virtual_address_t m_virtual_addresses[DSM_VIRTUAL_ADDR_MAX];
/** Non-virtual addresses */
static regular_address_t m_addresses[DSM_NONVIRTUAL_ADDR_MAX];
/** Local RX unicast address */
static dsm_local_unicast_address_t m_local_unicast_addr;
/** Security information for each subnet and its associated application */
static subnet_t m_subnets[DSM_SUBNET_MAX];

#if MESH_FEATURE_LPN_ENABLED
/** Security information for friendship */
static friendship_t m_friendships[MESH_FRIENDSHIP_CREDENTIALS];
#endif

/** Security information associated with each appkey */
static appkey_t m_appkeys[DSM_APP_MAX];
/** Security information associated with each devkey */
static devkey_t m_devkeys[DSM_DEVICE_MAX];

/** Flag indicating whether the device is part of the primary subnet */
static bool m_has_primary_subnet;
/** Mesh event handler */
static nrf_mesh_evt_handler_t m_mesh_evt_handler;

/* Bitfields for all entry types, indicating whether they're allocated or not. */
static uint32_t m_addr_unicast_allocated[BITFIELD_BLOCK_COUNT(1)];
static uint32_t m_addr_nonvirtual_allocated[BITFIELD_BLOCK_COUNT(DSM_NONVIRTUAL_ADDR_MAX)];
static uint32_t m_addr_virtual_allocated[BITFIELD_BLOCK_COUNT(DSM_VIRTUAL_ADDR_MAX)];
static uint32_t m_subnet_allocated[BITFIELD_BLOCK_COUNT(DSM_SUBNET_MAX)];
static uint32_t m_appkey_allocated[BITFIELD_BLOCK_COUNT(DSM_APP_MAX)];
static uint32_t m_devkey_allocated[BITFIELD_BLOCK_COUNT(DSM_DEVICE_MAX)];
/* Bitfields for all entry types, indicating whether or not they need their flash representation to
 * be updated. */
static uint32_t m_addr_unicast_needs_flashing[BITFIELD_BLOCK_COUNT(1)];
static uint32_t m_addr_nonvirtual_needs_flashing[BITFIELD_BLOCK_COUNT(DSM_NONVIRTUAL_ADDR_MAX)];
static uint32_t m_addr_virtual_needs_flashing[BITFIELD_BLOCK_COUNT(DSM_VIRTUAL_ADDR_MAX)];
static uint32_t m_subnet_needs_flashing[BITFIELD_BLOCK_COUNT(DSM_SUBNET_MAX)];
static uint32_t m_appkey_needs_flashing[BITFIELD_BLOCK_COUNT(DSM_APP_MAX)];
static uint32_t m_devkey_needs_flashing[BITFIELD_BLOCK_COUNT(DSM_DEVICE_MAX)];

/*****************************************************************************
* Static functions
*****************************************************************************/

static bool flash_save(dsm_entry_type_t type, uint32_t index);
static bool flash_invalidate(dsm_entry_type_t type, uint32_t index);

/* Checks if a given address handle is a valid non-virtual address handle. */
static inline bool address_handle_nonvirtual_valid(dsm_handle_t address_handle)
{
    if (address_handle >= DSM_NONVIRTUAL_ADDR_MAX || !bitfield_get(m_addr_nonvirtual_allocated, address_handle))
    {
        return false;
    }
    else
    {
        return true;
    }
}

/* Checks if a given address handle is a valid virtual address handle. */
static inline bool address_handle_virtual_valid(dsm_handle_t address_handle)
{
    address_handle -= DSM_VIRTUAL_HANDLE_START;
    if (address_handle >= DSM_VIRTUAL_ADDR_MAX || !bitfield_get(m_addr_virtual_allocated, address_handle))
    {
        return false;
    }
    else
    {
        return true;
    }
}

static inline bool address_handle_valid(dsm_handle_t address_handle)
{
    return (address_handle_nonvirtual_valid(address_handle) ||
            address_handle_virtual_valid(address_handle));
}


/** Gets whether the given address is one of our local unicast addresses. */
static inline bool is_own_unicast_addr(uint16_t addr)
{
    return (bitfield_get(m_addr_unicast_allocated, 0) &&
            addr >= m_local_unicast_addr.address_start &&
            addr < m_local_unicast_addr.address_start + m_local_unicast_addr.count);
}

/** Gets the unicast address if it's in the rx address list.
 *  Returns true if found, otherwise false.
 */
static bool rx_unicast_address_get(uint16_t address, nrf_mesh_address_t * p_address)
{
    if (is_own_unicast_addr(address))
    {
        p_address->value = address;
        p_address->type = NRF_MESH_ADDRESS_TYPE_UNICAST;
        p_address->p_virtual_uuid = NULL;
        return true;
    }
    return false;
}

/** Checks if an address exists in the rx address list.
 *  Returns a suitable location for a new address if it does not.
 */
static bool address_exists(uint16_t address, dsm_handle_t * p_handle, nrf_mesh_address_type_t * p_type)
{
    *p_handle = DSM_HANDLE_INVALID;

    *p_type = nrf_mesh_address_type_get(address);
    if (*p_type == NRF_MESH_ADDRESS_TYPE_VIRTUAL)
    {
        for (uint32_t i = 0; i < DSM_VIRTUAL_ADDR_MAX; ++i)
        {
            if (*p_handle == DSM_HANDLE_INVALID && !bitfield_get(m_addr_virtual_allocated, i))
            {
                *p_handle = i;
            }
            else if (m_virtual_addresses[i].address == address)
            {
                *p_handle = i;
                return true;
            }
        }
    }
    else if (*p_type == NRF_MESH_ADDRESS_TYPE_GROUP || *p_type == NRF_MESH_ADDRESS_TYPE_UNICAST)
    {
        for (uint32_t i = 0; i < DSM_NONVIRTUAL_ADDR_MAX; ++i)
        {
            if (*p_handle == DSM_HANDLE_INVALID && !bitfield_get(m_addr_nonvirtual_allocated, i))
            {
                *p_handle = i;
            }
            else if (m_addresses[i].address == address)
            {
                *p_handle = i;
                return true;
            }
        }
    }

