NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/access/src/device_state_manager.c
/** Checks if the given appkey index exists in the appkey list.
 *  Provides a suitable location for a new appkey via p_handle if it does not.
 *  Returns true if the appkey exists, otherwise false.
 */
static bool app_key_handle_get(mesh_key_index_t app_key_index, dsm_handle_t * p_handle)
{
    *p_handle = DSM_HANDLE_INVALID;
    for (uint32_t i = 0; i < DSM_APP_MAX; i++)
    {
        if (bitfield_get(m_appkey_allocated, i))
        {
            if (m_appkeys[i].app_key_index == app_key_index)
            {
                *p_handle = i;
                return true;
            }
        }
        else if (*p_handle == DSM_HANDLE_INVALID)
        {
            *p_handle = i;
        }
    }
    return false;
}

/** Provides all the available appkey indices via p_key_list.
 *  Returns false if the given list is not large enough to store all the available appkey indices.
 */
static bool get_all_appkeys(dsm_handle_t subnet_handle, mesh_key_index_t * p_key_list, uint32_t * p_count)
{
    const uint32_t key_list_max_size = *p_count;
    *p_count = 0;

    for (uint32_t i = 0; i < DSM_APP_MAX; ++i)
    {
        if (bitfield_get(m_appkey_allocated, i) && m_appkeys[i].subnet_handle == subnet_handle)
        {
            if (*p_count == key_list_max_size)
            {
                /* We would be overstepping the buffer size if we add one more */
                return false;
            }
            p_key_list[*p_count] = m_appkeys[i].app_key_index;
            (*p_count)++;
        }
    }
    return true;
}

/** Provides all the available network key indices via p_key_list.
 *  Returns false if the given list is not large enough to store all the available network key indices.
 */
static bool get_all_subnets(mesh_key_index_t * p_key_list, uint32_t * p_count)
{
    const uint32_t key_list_max_size = *p_count;
    *p_count = 0;

    for (uint32_t i = 0; (i < DSM_SUBNET_MAX); ++i)
    {
        if (bitfield_get(m_subnet_allocated, i))
        {
            if (*p_count == key_list_max_size)
            {
                /* We would be overstepping the buffer size if we add one more */
                return false;
            }
            p_key_list[*p_count] = m_subnets[i].net_key_index;
            (*p_count)++;
        }
    }
    return true;
}

/** Returns the index to the m_subnets array for the given network secmat,
 *  Returns DSM_HANDLE_INVALID if not found.
 */
static dsm_handle_t get_subnet_handle(const nrf_mesh_network_secmat_t * p_secmat)
{
    NRF_MESH_ASSERT(NULL != p_secmat);

    dsm_handle_t retval = DSM_HANDLE_INVALID;
    for(uint16_t i = 0; i < DSM_SUBNET_MAX; i++)
    {
        if (m_subnets[i].key_refresh_phase != NRF_MESH_KEY_REFRESH_PHASE_0)
        {
            if (p_secmat == &m_subnets[i].secmat || p_secmat == &m_subnets[i].secmat_updated)
            {
                retval = i;
                break;
            }
        }
        else if (p_secmat == &m_subnets[i].secmat)
        {
            retval = i;
            break;
        }
    }

    return retval;
}

#if MESH_FEATURE_LPN_ENABLED
/**
 * Returns an index of the m_friendships array for the given network secmat
 * Returns end of m_friendship array if secmat is not found
 */
static uint32_t friendship_index_by_secmat_get(const nrf_mesh_network_secmat_t * p_secmat)
{
    uint32_t j = 0;
    for (; j < ARRAY_SIZE(m_friendships); j++)
    {
        if (m_friendships[j].subnet_handle != DSM_HANDLE_INVALID)
        {
            if (p_secmat == &m_friendships[j].secmat ||
                (p_secmat == &m_friendships[j].secmat_updated &&
                m_subnets[m_friendships[j].subnet_handle].key_refresh_phase != NRF_MESH_KEY_REFRESH_PHASE_0))
            {
                return j;
            }
        }
    }

    return j;
}
#endif  /* MESH_FEATURE_LPN_ENABLED */

/** Returns the index to the m_subnets array for the given beacon info,
 *  Returns DSM_HANDLE_INVALID if not found.
 */
static dsm_handle_t get_subnet_handle_by_beacon_info(const nrf_mesh_beacon_info_t * p_beacon_info)
{
    NRF_MESH_ASSERT(NULL != p_beacon_info);

    if (p_beacon_info >= &m_subnets[0].beacon.info &&
        p_beacon_info <= &m_subnets[DSM_SUBNET_MAX - 1].beacon.info)
    {
        /* The beacon info is offset by the same amount in each structure, so since
         * we're getting the delta between two substructures of the same structure
         * type, this will get the right index. */
        return (((uint32_t) p_beacon_info - (uint32_t) &m_subnets[0].beacon.info) / sizeof(subnet_t));
    }
    return DSM_HANDLE_INVALID;
}

/** Returns the index to the m_appkeys array for the given appkey secmat,
 *  Returns DSM_HANDLE_INVALID if not found.
 */
static dsm_handle_t get_app_handle(const nrf_mesh_application_secmat_t * p_secmat)
{
    NRF_MESH_ASSERT(NULL != p_secmat);

    if (p_secmat >= &m_appkeys[0].secmat &&
        p_secmat <= &m_appkeys[DSM_APP_MAX - 1].secmat)
    {
        /* The secmat is offset by the same amount in each structure, so since
         * we're getting the delta between two substructures of the same structure
         * type, this will get the right index. */
        return (((uint32_t) p_secmat - (uint32_t) &m_appkeys[0].secmat) / sizeof(appkey_t));
    }
    else if (p_secmat >= &m_devkeys[0].secmat &&
             p_secmat <= &m_devkeys[DSM_DEVICE_MAX - 1].secmat)
    {
        /* The secmat is offset by the same amount in each structure, so since
         * we're getting the delta between two substructures of the same structure
         * type, this will get the right index. */
        return DSM_DEVKEY_HANDLE_START + (((uint32_t) p_secmat - (uint32_t) &m_devkeys[0].secmat) / sizeof(devkey_t));

    }
    return DSM_HANDLE_INVALID;
}

static void net_beacon_rx_handle(const nrf_mesh_beacon_info_t * p_beacon_info,
                                 const nrf_mesh_beacon_secmat_t * p_secmat,
                                 uint32_t iv_index,
                                 bool iv_update,
                                 bool key_refresh)
{
    dsm_handle_t subnet_handle = get_subnet_handle_by_beacon_info(p_beacon_info);
    if (subnet_handle == DSM_HANDLE_INVALID)
    {
        return;
    }

    if (p_secmat == &p_beacon_info->secmat_updated)
    {
        if (key_refresh)
        {
            if (m_subnets[subnet_handle].key_refresh_phase == NRF_MESH_KEY_REFRESH_PHASE_1)
            {
                (void) dsm_subnet_update_swap_keys(subnet_handle);
            }
        }
        else
        {
            if (m_subnets[subnet_handle].key_refresh_phase != NRF_MESH_KEY_REFRESH_PHASE_0)
            {
                (void) dsm_subnet_update_commit(subnet_handle);
            }
        }
    }
}

#if MESH_FEATURE_LPN_ENABLED
static void friend_update_rx_handle(const nrf_mesh_network_secmat_t * p_net_secmat,
                                    uint32_t iv_index,
                                    bool iv_update,
                                    bool key_refresh)
{
    dsm_handle_t subnet_handle = dsm_subnet_handle_get(p_net_secmat);
    NRF_MESH_ASSERT_DEBUG(subnet_handle != DSM_HANDLE_INVALID);

