NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/access/src/device_state_manager.c
    if (key_refresh)
    {
        if (m_subnets[subnet_handle].key_refresh_phase == NRF_MESH_KEY_REFRESH_PHASE_1)
        {
            (void) dsm_subnet_update_swap_keys(subnet_handle);
        }
    }
    else
    {
        if (m_subnets[subnet_handle].key_refresh_phase != NRF_MESH_KEY_REFRESH_PHASE_0)
        {
            (void) dsm_subnet_update_commit(subnet_handle);
        }
    }
}
#endif

static bool get_net_secmat_by_nid(dsm_handle_t subnet_handle, uint8_t nid,
                                  const nrf_mesh_network_secmat_t * p_secmat_cmp,
                                  const nrf_mesh_network_secmat_t * p_secmat_secondary_cmp,
                                  const nrf_mesh_network_secmat_t ** pp_secmat_out,
                                  const nrf_mesh_network_secmat_t ** pp_secmat_secondary_out)
{
    if (!bitfield_get(m_subnet_allocated, subnet_handle))
    {
        return false;
    }

    /* If the NIDs for the old and the new network are equal, return both: */
    if (m_subnets[subnet_handle].key_refresh_phase != NRF_MESH_KEY_REFRESH_PHASE_0
        && (p_secmat_cmp->nid == nid && p_secmat_secondary_cmp->nid == nid))
    {
        *pp_secmat_out = p_secmat_cmp;
        *pp_secmat_secondary_out = p_secmat_secondary_cmp;
        return true;
    }
    /* During key refresh, return the updated key if it matches the NID: */
    else if (m_subnets[subnet_handle].key_refresh_phase != NRF_MESH_KEY_REFRESH_PHASE_0
             && p_secmat_secondary_cmp->nid == nid)
    {
        *pp_secmat_out = p_secmat_secondary_cmp;
        *pp_secmat_secondary_out = NULL;
        return true;
    }
    else if (p_secmat_cmp->nid == nid)
    {
        *pp_secmat_out = p_secmat_cmp;
        *pp_secmat_secondary_out = NULL;
        return true;
    }

    return false;
}

static const nrf_mesh_application_secmat_t * get_devkey_secmat(uint16_t key_address)
{
    if (key_address == NRF_MESH_ADDR_UNASSIGNED)
    {
        return NULL;
    }
    for (uint32_t i = 0; i < DSM_DEVICE_MAX; ++i)
    {
        if (m_devkeys[i].key_owner == key_address)
        {
            return &m_devkeys[i].secmat;
        }
    }
    return NULL;
}

static void get_app_secmat(dsm_handle_t subnet_handle, uint8_t aid, const nrf_mesh_application_secmat_t ** pp_app_secmat)
{
    uint32_t i = 0;
    if (*pp_app_secmat != NULL)
    {
        /* Iterate over the proceeding elements */
        i = get_app_handle(*pp_app_secmat) + 1;
    }
    for (; i < DSM_APP_MAX; i++)
    {
        if (bitfield_get(m_appkey_allocated, i) &&
            m_appkeys[i].subnet_handle == subnet_handle &&
            ((m_appkeys[i].secmat.aid & PACKET_MESH_TRS_ACCESS_AID_MASK) == (aid & PACKET_MESH_TRS_ACCESS_AID_MASK)))
        {
            *pp_app_secmat = &m_appkeys[i].secmat;
            return;
        }
    }
    *pp_app_secmat = NULL;
}

static uint32_t app_tx_secmat_get(dsm_handle_t app_handle, dsm_handle_t *p_subnet_handle, const nrf_mesh_application_secmat_t ** p_app)
{
    if (app_handle >= DSM_DEVKEY_HANDLE_START + DSM_DEVICE_MAX)
    {
        return NRF_ERROR_NOT_FOUND;
    }

    if (!bitfield_get(app_handle < DSM_DEVKEY_HANDLE_START ? m_appkey_allocated : m_devkey_allocated,
                      app_handle < DSM_DEVKEY_HANDLE_START ? app_handle : app_handle - DSM_DEVKEY_HANDLE_START))
    {
        return NRF_ERROR_NOT_FOUND;
    }

    if (DSM_HANDLE_INVALID == *p_subnet_handle)
    {
        *p_subnet_handle = app_handle < DSM_DEVKEY_HANDLE_START ? m_appkeys[app_handle].subnet_handle :
                           m_devkeys[app_handle - DSM_DEVKEY_HANDLE_START].subnet_handle;
    }

    if (*p_subnet_handle >= DSM_SUBNET_MAX || !bitfield_get(m_subnet_allocated, *p_subnet_handle))
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (app_handle < DSM_DEVKEY_HANDLE_START)
    {/* Application key */
        /* Use updated application security credentials (if available) during key refresh phase 2: */
        if (m_subnets[*p_subnet_handle].key_refresh_phase == NRF_MESH_KEY_REFRESH_PHASE_2 && m_appkeys[app_handle].key_updated)
        {
            *p_app = &m_appkeys[app_handle].secmat_updated;
        }
        else
        {
            *p_app = &m_appkeys[app_handle].secmat;
        }
    }
    else
    {/* Device key */
        *p_app = &m_devkeys[app_handle - DSM_DEVKEY_HANDLE_START].secmat;
    }

    return NRF_SUCCESS;
}

static void subnet_set(mesh_key_index_t net_key_index, const uint8_t * p_key, dsm_handle_t handle)
{
    m_subnets[handle].beacon.info.p_tx_info = &m_subnets[handle].beacon.tx_info;
    if (net_key_index == PRIMARY_SUBNET_INDEX)
    {
        m_has_primary_subnet = true;
    }
    NRF_MESH_ASSERT(NRF_SUCCESS == nrf_mesh_keygen_network_secmat(p_key, &m_subnets[handle].secmat));
    NRF_MESH_ASSERT(NRF_SUCCESS == nrf_mesh_keygen_beacon_secmat(p_key, &m_subnets[handle].beacon.info.secmat));
#if MESH_FEATURE_GATT_PROXY_ENABLED
    NRF_MESH_ASSERT(NRF_SUCCESS == nrf_mesh_keygen_identitykey(p_key, m_subnets[handle].beacon.info.secmat.identity_key));
#endif

    memcpy(m_subnets[handle].root_key, p_key, NRF_MESH_KEY_SIZE);
    memset(m_subnets[handle].root_key_updated, 0, NRF_MESH_KEY_SIZE);

    m_subnets[handle].net_key_index = net_key_index;
    m_subnets[handle].key_refresh_phase = NRF_MESH_KEY_REFRESH_PHASE_0;
    bitfield_set(m_subnet_allocated, handle);
    bitfield_set(m_subnet_needs_flashing, handle);
}

static void appkey_set(mesh_key_index_t app_key_index, dsm_handle_t subnet_handle, const uint8_t * p_key, dsm_handle_t handle)
{
    memcpy(m_appkeys[handle].secmat.key, p_key, NRF_MESH_KEY_SIZE);
    memset(m_appkeys[handle].secmat_updated.key, 0, NRF_MESH_KEY_SIZE);
    NRF_MESH_ASSERT(NRF_SUCCESS == nrf_mesh_keygen_aid(p_key, &m_appkeys[handle].secmat.aid));
    m_appkeys[handle].secmat.is_device_key = false;
    m_appkeys[handle].key_updated = false;
    m_appkeys[handle].app_key_index = app_key_index;
    m_appkeys[handle].subnet_handle = subnet_handle;
    bitfield_set(m_appkey_allocated, handle);
    bitfield_set(m_appkey_needs_flashing, handle);
}

