NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/access/src/device_state_manager.c
static void devkey_set(uint16_t key_owner, dsm_handle_t subnet_handle, const uint8_t * p_key, dsm_handle_t handle)
{
    uint32_t index = handle - DSM_DEVKEY_HANDLE_START;
    memcpy(m_devkeys[index].secmat.key, p_key, NRF_MESH_KEY_SIZE);
    m_devkeys[index].secmat.aid = 0;
    m_devkeys[index].secmat.is_device_key = true;
    m_devkeys[index].subnet_handle = subnet_handle;
    m_devkeys[index].key_owner = key_owner;
    bitfield_set(m_devkey_allocated, index);
    bitfield_set(m_devkey_needs_flashing, index);
}

static void nonvirtual_address_set(uint16_t raw_address, dsm_handle_t handle)
{
    m_addresses[handle].address = raw_address;
    m_addresses[handle].subscription_count = 0;
    m_addresses[handle].publish_count = 0;
    bitfield_set(m_addr_nonvirtual_allocated, handle);
    bitfield_set(m_addr_nonvirtual_needs_flashing, handle);
}

static void virtual_address_set(const uint8_t * p_label_uuid, dsm_handle_t handle)
{
    uint32_t index = handle - DSM_VIRTUAL_HANDLE_START;
    memcpy(m_virtual_addresses[index].uuid, p_label_uuid, NRF_MESH_UUID_SIZE);
    NRF_MESH_ASSERT(nrf_mesh_keygen_virtual_address(p_label_uuid, &m_virtual_addresses[index].address) == NRF_SUCCESS);
    bitfield_set(m_addr_virtual_allocated, index);
    bitfield_set(m_addr_virtual_needs_flashing, index);
}

static uint32_t address_delete_if_unused(dsm_handle_t address_handle)
{
    if (address_handle_nonvirtual_valid(address_handle))
    {
        if (m_addresses[address_handle].publish_count == 0 && m_addresses[address_handle].subscription_count == 0)
        {
            bitfield_clear(m_addr_nonvirtual_allocated, address_handle);
            m_addresses[address_handle].address = NRF_MESH_ADDR_UNASSIGNED;
            (void) flash_invalidate(DSM_ENTRY_TYPE_ADDR_NONVIRTUAL, address_handle);
        }

        return NRF_SUCCESS;
    }
    else if (address_handle_virtual_valid(address_handle))
    {
        uint32_t addr_virtual_index = address_handle - DSM_VIRTUAL_HANDLE_START;

        if (m_virtual_addresses[addr_virtual_index].publish_count == 0 &&
            m_virtual_addresses[addr_virtual_index].subscription_count == 0)
        {
            bitfield_clear(m_addr_virtual_allocated, addr_virtual_index);
            m_virtual_addresses[addr_virtual_index].address = NRF_MESH_ADDR_UNASSIGNED;
            (void) flash_invalidate(DSM_ENTRY_TYPE_ADDR_VIRTUAL, addr_virtual_index);
        }

        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_NOT_FOUND;
    }
}

static uint32_t add_address(uint16_t raw_address, dsm_handle_t * p_address_handle, dsm_address_role_t role)
{
    if (p_address_handle == NULL)
    {
        return NRF_ERROR_NULL;
    }

    nrf_mesh_address_type_t type;
    dsm_handle_t handle;

    bool address_found = address_exists(raw_address, &handle, &type);
    uint32_t status = NRF_SUCCESS;
    /* Check if the address type is valid. */
    if (
        (role == DSM_ADDRESS_ROLE_SUBSCRIBE && type != NRF_MESH_ADDRESS_TYPE_GROUP)
        ||
        (role == DSM_ADDRESS_ROLE_PUBLISH
            && type != NRF_MESH_ADDRESS_TYPE_GROUP && type != NRF_MESH_ADDRESS_TYPE_UNICAST)
       )
    {
        status = NRF_ERROR_INVALID_ADDR;
    }
    else if (!address_found)
    {
        if (handle == DSM_HANDLE_INVALID)
        {
            status = NRF_ERROR_NO_MEM;
        }
        else
        {
            nonvirtual_address_set(raw_address, handle);
            (void) flash_save(DSM_ENTRY_TYPE_ADDR_NONVIRTUAL, handle);
        }
    }

    if (status == NRF_SUCCESS)
    {
        *p_address_handle = handle;
        if (role == DSM_ADDRESS_ROLE_SUBSCRIBE)
        {
#if MESH_FEATURE_LPN_ENABLED
            if (m_addresses[*p_address_handle].subscription_count == 0 && mesh_lpn_is_in_friendship())
            {
                NRF_MESH_ASSERT_DEBUG(mesh_lpn_subman_add(m_addresses[*p_address_handle].address) == NRF_SUCCESS);
            }
#endif
            m_addresses[*p_address_handle].subscription_count++;
        }
        else
        {
            m_addresses[*p_address_handle].publish_count++;
        }
    }
    return status;
}

static uint32_t add_address_virtual(const uint8_t * p_label_uuid, dsm_handle_t * p_address_handle, dsm_address_role_t role)
{
    uint16_t dest = DSM_HANDLE_INVALID;
    if (p_label_uuid == NULL || p_address_handle == NULL)
    {
        return NRF_ERROR_NULL;
    }
    bool address_found = virtual_address_uuid_index_get(p_label_uuid, &dest);
    dsm_handle_t handle = dest + DSM_VIRTUAL_HANDLE_START;

    if (!address_found)
    {
        if (dest == DSM_HANDLE_INVALID)
        {
            return NRF_ERROR_NO_MEM;
        }

        virtual_address_set(p_label_uuid, handle);
        (void) flash_save(DSM_ENTRY_TYPE_ADDR_VIRTUAL, dest);
    }
    *p_address_handle = handle;
    if (role == DSM_ADDRESS_ROLE_SUBSCRIBE)
    {
#if MESH_FEATURE_LPN_ENABLED
        if (m_virtual_addresses[dest].subscription_count == 0 && mesh_lpn_is_in_friendship())
        {
            NRF_MESH_ASSERT_DEBUG(mesh_lpn_subman_add(m_virtual_addresses[dest].address) == NRF_SUCCESS);
        }
#endif
        m_virtual_addresses[dest].subscription_count++;
    }
    else
    {
        m_virtual_addresses[dest].publish_count++;
    }
    return NRF_SUCCESS;
}

#if MESH_FEATURE_LPN_ENABLED
static void friendship_clear(friendship_t *p_friendship)
{
    p_friendship->subnet_handle = DSM_HANDLE_INVALID;
    memset(&p_friendship->secmat, 0x00, sizeof(nrf_mesh_network_secmat_t));
    memset(&p_friendship->secmat_updated, 0x00, sizeof(nrf_mesh_network_secmat_t));
}

static void friendship_established_handle(void)
{
    for (uint32_t i = 0; i < DSM_NONVIRTUAL_ADDR_MAX; ++i)
    {
        if (bitfield_get(m_addr_nonvirtual_allocated, i) && m_addresses[i].subscription_count > 0)
        {
            NRF_MESH_ASSERT_DEBUG(mesh_lpn_subman_add(m_addresses[i].address) == NRF_SUCCESS);
        }
    }

    for (uint32_t i = 0; i < DSM_VIRTUAL_ADDR_MAX; ++i)
    {
        if (bitfield_get(m_addr_virtual_allocated, i) && m_virtual_addresses[i].subscription_count > 0)
        {
            NRF_MESH_ASSERT_DEBUG(mesh_lpn_subman_add(m_virtual_addresses[i].address) == NRF_SUCCESS);
        }
    }

