NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/access/src/device_state_manager.c
    const heartbeat_subscription_state_t * p_hb_sub = heartbeat_subscription_get();
    if (nrf_mesh_address_type_get(p_hb_sub->dst) == NRF_MESH_ADDRESS_TYPE_GROUP)
    {
        NRF_MESH_ASSERT_DEBUG(mesh_lpn_subman_add(p_hb_sub->dst) == NRF_SUCCESS);
    }
}

static void friendship_termination_handle(const nrf_mesh_evt_friendship_terminated_t *p_terminated)
{
    for (uint32_t i = 0; i < ARRAY_SIZE(m_friendships); i++)
    {
        if ((m_friendships[i].secmat_params.friend_address == p_terminated->friend_src)
            && (m_friendships[i].secmat_params.lpn_address == p_terminated->lpn_src))
        {
            friendship_clear(&m_friendships[i]);
        }
    }
}
#endif /* MESH_FEATURE_LPN_ENABLED */

static void mesh_evt_handler(const nrf_mesh_evt_t * p_evt)
{
    switch (p_evt->type)
    {
        case NRF_MESH_EVT_NET_BEACON_RECEIVED:
            net_beacon_rx_handle(p_evt->params.net_beacon.p_beacon_info,
                                p_evt->params.net_beacon.p_beacon_secmat,
                                p_evt->params.net_beacon.iv_index,
                                p_evt->params.net_beacon.flags.iv_update,
                                p_evt->params.net_beacon.flags.key_refresh);
            break;
#if MESH_FEATURE_LPN_ENABLED
        case NRF_MESH_EVT_FRIENDSHIP_ESTABLISHED:
            friendship_established_handle();
            break;
        case NRF_MESH_EVT_LPN_FRIEND_UPDATE:
            friend_update_rx_handle(p_evt->params.friend_update.p_secmat_net,
                                    p_evt->params.friend_update.iv_index,
                                    p_evt->params.friend_update.iv_update_active,
                                    p_evt->params.friend_update.key_refresh_in_phase2);
            break;
        case NRF_MESH_EVT_FRIENDSHIP_TERMINATED:
            friendship_termination_handle(&p_evt->params.friendship_terminated);
            break;
        case NRF_MESH_EVT_LPN_FRIEND_REQUEST_TIMEOUT:
            friendship_clear(&m_friendships[0]);
            break;
        case NRF_MESH_EVT_HB_SUBSCRIPTION_CHANGE:
            /* We need to add and remove heartbeat subscription addresses to/from the LPN
             * subscription list to ensure that the friend delivers the messages to us */
            if (mesh_lpn_is_in_friendship())
            {
                if (p_evt->params.hb_subscription_change.p_old != NULL &&
                    (nrf_mesh_address_type_get(p_evt->params.hb_subscription_change.p_old->dst) ==
                     NRF_MESH_ADDRESS_TYPE_GROUP))
                {
                    /* Shouldn't remove the heartbeat subscription if there's a model that subscribes to it as well. */
                    dsm_handle_t dummy_handle;
                    if (non_virtual_address_handle_get(p_evt->params.hb_subscription_change.p_old->dst,
                                                       &dummy_handle) != NRF_SUCCESS)
                    {
                        NRF_MESH_ASSERT_DEBUG(
                            mesh_lpn_subman_remove(p_evt->params.hb_subscription_change.p_old->dst) ==
                            NRF_SUCCESS);
                    }
                }

                if (p_evt->params.hb_subscription_change.p_new != NULL &&
                    (nrf_mesh_address_type_get(p_evt->params.hb_subscription_change.p_new->dst) ==
                     NRF_MESH_ADDRESS_TYPE_GROUP))
                {
                    /* Adding duplicate addresses isn't a problem, no need to check if a model subscribes to it. */
                    NRF_MESH_ASSERT_DEBUG(
                        mesh_lpn_subman_add(p_evt->params.hb_subscription_change.p_new->dst) ==
                        NRF_SUCCESS);
                }
            }
#endif
        default:
            break;
    }
}
/******************************* FLASH STORAGE MANAGEMENT *****************************************/

#if PERSISTENT_STORAGE
/** Flash manager owning the flash storage area. */
static flash_manager_t m_flash_manager;
/** State of our flash system */
static bool m_flash_is_available;
/** Memory listener used to recover from no-mem returns on the flash manager. */
static fm_mem_listener_t m_flash_mem_listener_update_all;

/* Flash utility functions */
static void addr_unicast_to_flash_entry(uint32_t index, dsm_flash_entry_t * p_dst, uint16_t * p_entry_len);

static void addr_nonvirtual_to_flash_entry(uint32_t index, dsm_flash_entry_t * p_dst, uint16_t * p_entry_len);
static void addr_virtual_to_flash_entry(uint32_t index, dsm_flash_entry_t * p_dst, uint16_t * p_entry_len);
static void subnet_to_flash_entry(uint32_t index, dsm_flash_entry_t * p_dst, uint16_t * p_entry_len);
static void appkey_to_flash_entry(uint32_t index, dsm_flash_entry_t * p_dst, uint16_t * p_entry_len);
static void devkey_to_flash_entry(uint32_t index, dsm_flash_entry_t * p_dst, uint16_t * p_entry_len);

static void addr_unicast_to_dsm_entry(uint32_t index, const dsm_flash_entry_t * p_dst, uint16_t entry_len);

static void addr_nonvirtual_to_dsm_entry(uint32_t index, const dsm_flash_entry_t * p_dst, uint16_t entry_len);
static void addr_virtual_to_dsm_entry(uint32_t index, const dsm_flash_entry_t * p_dst, uint16_t entry_len);
static void subnet_to_dsm_entry(uint32_t index, const dsm_flash_entry_t * p_dst, uint16_t entry_len);
static void appkey_to_dsm_entry(uint32_t index, const dsm_flash_entry_t * p_dst, uint16_t entry_len);
static void devkey_to_dsm_entry(uint32_t index, const dsm_flash_entry_t * p_dst, uint16_t entry_len);
static void build_flash_area(void);


/* Each entry type is represented as a flash group. The flash group contains information about the
 * entry type on flash status and behavior, to enable generalizing of the flash access. */

/** Macro to improve readability of flash group definitions. */
#define FLASH_GROUP(NAME, COUNT, FLASH_START_HANDLE)                                \
    {                                                                               \
        .entry_count               = COUNT,                                         \
        .p_allocated_bitfield      = m_##NAME##_allocated,                          \
        .p_needs_flashing_bitfield = m_##NAME##_needs_flashing,                     \
        .flash_start_handle        = FLASH_START_HANDLE,                            \
        .flash_entry_data_size     = sizeof(dsm_flash_entry_##NAME##_t),            \
        .to_flash_entry            = NAME##_to_flash_entry,                         \
        .to_dsm_entry              = NAME##_to_dsm_entry                            \
    }

/** Flash groups representing each entry type's behavior and status */
static const flash_group_t m_flash_groups[] =
{
    FLASH_GROUP(addr_unicast,    1,                       DSM_FLASH_HANDLE_UNICAST),
    FLASH_GROUP(addr_nonvirtual, DSM_NONVIRTUAL_ADDR_MAX, DSM_FLASH_GROUP_ADDR_NONVIRTUAL),
    FLASH_GROUP(addr_virtual,    DSM_VIRTUAL_ADDR_MAX,    DSM_FLASH_GROUP_ADDR_VIRTUAL),
    FLASH_GROUP(subnet,          DSM_SUBNET_MAX,          DSM_FLASH_GROUP_SUBNETS),
    FLASH_GROUP(appkey,          DSM_APP_MAX,             DSM_FLASH_GROUP_APPKEYS),
    FLASH_GROUP(devkey,          DSM_DEVICE_MAX,          DSM_FLASH_GROUP_DEVKEYS)
};
