NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/access/src/device_state_manager.c
#undef FLASH_GROUP

/* Make sure we have a group for each entry type. */
NRF_MESH_STATIC_ASSERT(sizeof(m_flash_groups) / sizeof(m_flash_groups[0]) == DSM_ENTRY_TYPES);


/*****************************************************************************
* Flash utility functions
*****************************************************************************/
static void addr_unicast_to_dsm_entry(uint32_t index, const dsm_flash_entry_t * p_entry, uint16_t entry_len)
{
    /* Ignore the index, as there can only be one. */
    const dsm_flash_entry_addr_unicast_t * p_unicast = &p_entry->addr_unicast;
    memcpy(&m_local_unicast_addr, &p_unicast->addr, sizeof(m_local_unicast_addr));
}

static void subnet_to_dsm_entry(uint32_t index, const dsm_flash_entry_t * p_entry, uint16_t entry_len)
{
    const dsm_flash_entry_subnet_t * p_key_data = &p_entry->subnet;
    subnet_set(p_key_data->key_index, p_key_data->key, index);

    m_subnets[index].key_refresh_phase = p_key_data->key_refresh_phase;
    if (m_subnets[index].key_refresh_phase != NRF_MESH_KEY_REFRESH_PHASE_0)
    {
        NRF_MESH_ASSERT(entry_len == ALIGN_VAL(sizeof(dsm_flash_entry_subnet_t), WORD_SIZE));
        memcpy(m_subnets[index].root_key_updated, p_key_data->key_updated, NRF_MESH_KEY_SIZE);
        NRF_MESH_ASSERT(nrf_mesh_keygen_network_secmat(p_key_data->key_updated, &m_subnets[index].secmat_updated) == NRF_SUCCESS);
    }
    else
    {
        NRF_MESH_ASSERT(entry_len == ALIGN_VAL(sizeof(dsm_flash_entry_subnet_t) - sizeof(p_key_data->key_updated), WORD_SIZE));
    }
}

static void appkey_to_dsm_entry(uint32_t index, const dsm_flash_entry_t * p_entry, uint16_t entry_len)
{
    const dsm_flash_entry_appkey_t * p_key_data = &p_entry->appkey;
    appkey_set(p_key_data->key_index, p_key_data->subnet_handle, p_key_data->key, index);

    /* The length of this entry is used to determine if the key is currently being updated: */
    if (entry_len == ALIGN_VAL(sizeof(dsm_flash_entry_appkey_t), WORD_SIZE))
    {
        m_appkeys[index].key_updated = true;
        memcpy(m_appkeys[index].secmat_updated.key, p_key_data->key_updated, NRF_MESH_KEY_SIZE);
        NRF_MESH_ASSERT(nrf_mesh_keygen_aid(p_key_data->key_updated, &m_appkeys[index].secmat_updated.aid) == NRF_SUCCESS);
        m_appkeys[index].secmat_updated.is_device_key = m_appkeys[index].secmat.is_device_key;
    }
    else
    {
        NRF_MESH_ASSERT(entry_len == ALIGN_VAL(sizeof(dsm_flash_entry_appkey_t) - sizeof(p_key_data->key_updated), WORD_SIZE));
    }
}

static void devkey_to_dsm_entry(uint32_t index, const dsm_flash_entry_t * p_entry, uint16_t entry_len)
{
    const dsm_flash_entry_devkey_t * p_key_data = &p_entry->devkey;
    devkey_set(p_key_data->key_owner,
               p_key_data->subnet_handle,
               p_key_data->key,
               DSM_DEVKEY_HANDLE_START + index);
}

static void addr_nonvirtual_to_dsm_entry(uint32_t index, const dsm_flash_entry_t * p_entry, uint16_t entry_len)
{
    const dsm_flash_entry_addr_nonvirtual_t * p_addr_data = &p_entry->addr_nonvirtual;
    nonvirtual_address_set(p_addr_data->addr, index);
}

static void addr_virtual_to_dsm_entry(uint32_t index, const dsm_flash_entry_t * p_entry, uint16_t entry_len)
{
    const dsm_flash_entry_addr_virtual_t * p_addr_data = &p_entry->addr_virtual;
    virtual_address_set(p_addr_data->uuid, DSM_VIRTUAL_HANDLE_START + index);
}


/******************************************************************************/

static void addr_unicast_to_flash_entry(uint32_t index, dsm_flash_entry_t * p_dst, uint16_t * p_entry_len)
{
    /* Ignore the index, as there can only be one. */
    dsm_flash_entry_addr_unicast_t * p_entry = &p_dst->addr_unicast;
    memcpy(&p_entry->addr, &m_local_unicast_addr, sizeof(dsm_local_unicast_address_t));
}

static void subnet_to_flash_entry(uint32_t index, dsm_flash_entry_t * p_dst, uint16_t * p_entry_len)
{
    dsm_flash_entry_subnet_t * p_entry = &p_dst->subnet;
    memset(p_entry, 0, sizeof(dsm_flash_entry_subnet_t));

    p_entry->key_index = m_subnets[index].net_key_index;
    p_entry->key_refresh_phase = m_subnets[index].key_refresh_phase;
    memcpy(p_entry->key, m_subnets[index].root_key, NRF_MESH_KEY_SIZE);

    if (m_subnets[index].key_refresh_phase != NRF_MESH_KEY_REFRESH_PHASE_0)
    {
        memcpy(p_entry->key_updated, m_subnets[index].root_key_updated, NRF_MESH_KEY_SIZE);
    }
    else
    {
        *p_entry_len -= sizeof(p_entry->key_updated) / WORD_SIZE;
    }
}

static void appkey_to_flash_entry(uint32_t index, dsm_flash_entry_t * p_dst, uint16_t * p_entry_len)
{
    dsm_flash_entry_appkey_t * p_entry = &p_dst->appkey;
    memset(p_entry, 0, sizeof(dsm_flash_entry_appkey_t));

    memcpy(p_entry->key, m_appkeys[index].secmat.key, NRF_MESH_KEY_SIZE);
    p_entry->key_index = m_appkeys[index].app_key_index;
    p_entry->subnet_handle = m_appkeys[index].subnet_handle;

    if (m_appkeys[index].key_updated)
    {
        memcpy(p_entry->key_updated, m_appkeys[index].secmat_updated.key, NRF_MESH_KEY_SIZE);
    }
    else
    {
        *p_entry_len -= sizeof(p_entry->key_updated) / WORD_SIZE;
    }
}

static void devkey_to_flash_entry(uint32_t index, dsm_flash_entry_t * p_dst, uint16_t * p_entry_len)
{
    dsm_flash_entry_devkey_t * p_entry = &p_dst->devkey;
    memcpy(p_entry->key, m_devkeys[index].secmat.key, NRF_MESH_KEY_SIZE);
    p_entry->key_owner = m_devkeys[index].key_owner;
    p_entry->subnet_handle = m_devkeys[index].subnet_handle;
}

static void addr_nonvirtual_to_flash_entry(uint32_t index, dsm_flash_entry_t * p_dst, uint16_t * p_entry_len)
{
    dsm_flash_entry_addr_nonvirtual_t * p_entry = &p_dst->addr_nonvirtual;
    p_entry->addr = m_addresses[index].address;
}

static void addr_virtual_to_flash_entry(uint32_t index, dsm_flash_entry_t * p_dst, uint16_t * p_entry_len)
{
    dsm_flash_entry_addr_virtual_t * p_entry = &p_dst->addr_virtual;
    memcpy(p_entry->uuid, m_virtual_addresses[index].uuid, NRF_MESH_UUID_SIZE);
}

/** Flash operation function to call when the memory returns. */
typedef void (*flash_op_func_t)(void);

static void flash_mem_listener_callback(void * p_args)
{
    NRF_MESH_ASSERT(p_args != NULL);
    flash_op_func_t func = (flash_op_func_t) p_args; /*lint !e611 Suspicious cast */
    func();
}

static inline dsm_entry_type_t flash_handle_to_entry_type(fm_handle_t flash_handle)
{
    fm_handle_t flash_group = DSM_FLASH_HANDLE_FILTER_MASK & flash_handle;
    switch (flash_group)
    {
        case 0:
            return (dsm_entry_type_t)((flash_handle & DSM_FLASH_HANDLE_TO_DSM_HANDLE_MASK) -
                                       DSM_FLASH_COLLECTION_HANDLE_FIRST);
        case DSM_FLASH_GROUP_SUBNETS:         return DSM_ENTRY_TYPE_SUBNET;
        case DSM_FLASH_GROUP_APPKEYS:         return DSM_ENTRY_TYPE_APPKEY;
        case DSM_FLASH_GROUP_DEVKEYS:         return DSM_ENTRY_TYPE_DEVKEY;
        case DSM_FLASH_GROUP_ADDR_NONVIRTUAL: return DSM_ENTRY_TYPE_ADDR_NONVIRTUAL;
        case DSM_FLASH_GROUP_ADDR_VIRTUAL:    return DSM_ENTRY_TYPE_ADDR_VIRTUAL;
    }
    /* Found entry that doesn't belong to a flash group */
    NRF_MESH_ASSERT(false);
    return (dsm_entry_type_t) 0;
}

