NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/access/src/device_state_manager.c
static inline fm_entry_t * dsm_flash_entry_alloc(fm_handle_t flash_handle, uint32_t data_size)
{
    return flash_manager_entry_alloc(&m_flash_manager,
                                     flash_handle,
                                     data_size);
}

static bool flash_store_metainfo(void)
{
    fm_entry_t * p_entry =
        dsm_flash_entry_alloc(DSM_FLASH_HANDLE_METAINFO, sizeof(dsm_flash_entry_metainfo_t));
    bool succeeded = (p_entry != NULL);
    if (succeeded)
    {
        dsm_flash_entry_metainfo_t * p_metainfo = (dsm_flash_entry_metainfo_t *) p_entry->data;
        p_metainfo->max_addrs_nonvirtual = DSM_NONVIRTUAL_ADDR_MAX;
        p_metainfo->max_addrs_virtual = DSM_VIRTUAL_ADDR_MAX;
        p_metainfo->max_subnets = DSM_SUBNET_MAX;
        p_metainfo->max_appkeys = DSM_APP_MAX;
        p_metainfo->max_devkeys = DSM_DEVICE_MAX;
        flash_manager_entry_commit(p_entry);
    }
    return succeeded;
}

static void flash_load(dsm_entry_type_t type, uint32_t index, const dsm_flash_entry_t * p_entry, uint16_t entry_len)
{
    NRF_MESH_ASSERT(type < DSM_ENTRY_TYPES);
    const flash_group_t * p_group = &m_flash_groups[type];

    p_group->to_dsm_entry(index, p_entry, entry_len);
    bitfield_set(p_group->p_allocated_bitfield, index);
}

static bool flash_save(dsm_entry_type_t type, uint32_t index)
{
    bearer_event_critical_section_begin();
    NRF_MESH_ASSERT(type < DSM_ENTRY_TYPES);
    const flash_group_t * p_group = &m_flash_groups[type];

    bool success = false;
    if (m_flash_is_available)
    {
        fm_entry_t * p_entry = dsm_flash_entry_alloc(p_group->flash_start_handle + index,
                                                     p_group->flash_entry_data_size);
        if (p_entry != NULL)
        {
            p_group->to_flash_entry(index, (dsm_flash_entry_t *) p_entry->data, &p_entry->header.len_words);
            flash_manager_entry_commit(p_entry);
            success = true;
        }
    }

    if (!success)
    {
        /* Mark the entry for later flashing */
        bitfield_set(p_group->p_needs_flashing_bitfield, index);
        flash_manager_mem_listener_register(&m_flash_mem_listener_update_all);
    }
    bearer_event_critical_section_end();
    return success;
}

static bool flash_invalidate(dsm_entry_type_t type, uint32_t index)
{
    bearer_event_critical_section_begin();
    NRF_MESH_ASSERT(type < DSM_ENTRY_TYPES);
    const flash_group_t * p_group = &m_flash_groups[type];

    bool success = false;
    if (m_flash_is_available)
    {
        success =
            (NRF_SUCCESS ==
             flash_manager_entry_invalidate(&m_flash_manager, p_group->flash_start_handle + index));
    }

    if (!success)
    {
        /* Mark the entry for later flashing */
        bitfield_set(p_group->p_needs_flashing_bitfield, index);
        flash_manager_mem_listener_register(&m_flash_mem_listener_update_all);
    }
    bearer_event_critical_section_end();
    return success;
}

/** Run through all entries, and update the flash state for the ones that need it. */
static void flash_update_all(void)
{
    bool flash_is_available = true;
    for (dsm_entry_type_t type = (dsm_entry_type_t) 0;
         type < DSM_ENTRY_TYPES && flash_is_available;
         ++type)
    {
        const flash_group_t * p_group = &m_flash_groups[type];
        if (!bitfield_is_all_clear(p_group->p_needs_flashing_bitfield, p_group->entry_count))
        {
            for (uint32_t index = 0; index < p_group->entry_count; index++)
            {
                if (bitfield_get(p_group->p_needs_flashing_bitfield, index))
                {
                    bool success;
                    if (bitfield_get(p_group->p_allocated_bitfield, index))
                    {
                        success = flash_save(type, index);
                    }
                    else
                    {
                        success = flash_invalidate(type, index);
                    }

                    if (success)
                    {
                        bitfield_clear(p_group->p_needs_flashing_bitfield, index);
                    }
                    else
                    {
                        flash_is_available = false;
                        break;
                    }
                }
            }
        }
    }
}

static fm_iterate_action_t flash_read_callback(const fm_entry_t * p_entry, void * p_args)
{
    if (p_entry->header.handle != DSM_FLASH_HANDLE_METAINFO)
    {
        dsm_entry_type_t type = flash_handle_to_entry_type(p_entry->header.handle);
        flash_load(type,
                    p_entry->header.handle - m_flash_groups[type].flash_start_handle,
                    (const dsm_flash_entry_t *) p_entry->data,
                    (p_entry->header.len_words - FLASH_MANAGER_ENTRY_LEN_OVERHEAD) * WORD_SIZE);
    }
    return FM_ITERATE_ACTION_CONTINUE;
}

/**
 * Erase all entries, and re-add up to date metainfo once removal is complete.
 */
static void reset_flash_area(void)
{
    m_flash_is_available = false;
    if (flash_manager_remove(&m_flash_manager) != NRF_SUCCESS)
    {
        /* Register the listener and wait for some memory to be freed up before we retry. */
        static fm_mem_listener_t mem_listener = {.callback = flash_mem_listener_callback,
                                                 .p_args = reset_flash_area};
        flash_manager_mem_listener_register(&mem_listener);
    }
}

static void flash_operation_complete(const fm_entry_t * p_entry, fm_result_t result)
{
    /* If we get an AREA_FULL then our calculations for flash space required are buggy. */
    NRF_MESH_ASSERT(result != FM_RESULT_ERROR_AREA_FULL);
    /* We do not invalidate in this module, so a NOT_FOUND should not be received. */
    NRF_MESH_ASSERT(result != FM_RESULT_ERROR_NOT_FOUND);
    if (result == FM_RESULT_ERROR_FLASH_MALFUNCTION)
    {
        /* Let the user know that the flash is dying. */
        nrf_mesh_evt_t evt =
        {
            .type = NRF_MESH_EVT_FLASH_FAILED,
            .params.flash_failed.user = NRF_MESH_FLASH_USER_ACCESS,
            .params.flash_failed.p_flash_entry = p_entry,
            .params.flash_failed.p_flash_page = NULL,
            .params.flash_failed.p_area = m_flash_manager.config.p_area,
            .params.flash_failed.page_count = m_flash_manager.config.page_count,
        };
        event_handle(&evt);
    }
}

static void flash_write_complete(const flash_manager_t * p_manager, const fm_entry_t * p_entry, fm_result_t result)
{
    flash_operation_complete(p_entry, result);
}

static void flash_invalidate_complete(const flash_manager_t * p_manager, fm_handle_t handle, fm_result_t result)
{
    flash_operation_complete(NULL, result);
}

static void flash_remove_complete(const flash_manager_t * p_manager)
{
    build_flash_area();
}

static void build_flash_area(void)
{
    bool success = false;
    flash_manager_config_t manager_config;
    manager_config.write_complete_cb      = flash_write_complete;
    manager_config.invalidate_complete_cb = flash_invalidate_complete;
    manager_config.remove_complete_cb     = flash_remove_complete;
    manager_config.min_available_space    = 0;
    manager_config.p_area = dsm_flash_area_get();
    manager_config.page_count = DSM_FLASH_PAGE_COUNT;

    /* Lock the bearer event handler to ensure that we don't enter and leave the BUILDING state
     * between adding and checking. */
    bearer_event_critical_section_begin();
    if (flash_manager_add(&m_flash_manager, &manager_config) == NRF_SUCCESS)
    {
        /* If we have to build the flash manager, it means that it's new, and there's no metainfo. */
        if (m_flash_manager.internal.state == FM_STATE_BUILDING)
        {
            success = flash_store_metainfo();
        }
        else
        {
            success = true;
        }
    }
    bearer_event_critical_section_end();

    if (success)
    {
        m_flash_is_available = true;
    }
    else
    {
        /* Register the listener and wait for some memory to be freed up before we retry. */
        static fm_mem_listener_t mem_listener = {.callback = flash_mem_listener_callback,
                                                 .p_args = build_flash_area};
        flash_manager_mem_listener_register(&mem_listener);
    }
}

bool dsm_flash_config_load(void)
{
    if (!m_flash_is_available)
    {
        return false;
    }
    dsm_flash_entry_metainfo_t metainfo;
    uint32_t metainfo_size = sizeof(metainfo);
    if (flash_manager_entry_read(&m_flash_manager,
                                 DSM_FLASH_HANDLE_METAINFO,
                                 &metainfo,
                                 &metainfo_size) != NRF_SUCCESS)
    {
        return false;
    }

    if (metainfo.max_addrs_nonvirtual != DSM_NONVIRTUAL_ADDR_MAX ||
        metainfo.max_addrs_virtual != DSM_VIRTUAL_ADDR_MAX ||
        metainfo.max_appkeys != DSM_APP_MAX ||
        metainfo.max_devkeys != DSM_DEVICE_MAX ||
        metainfo.max_subnets != DSM_SUBNET_MAX)
    {
        /* The area is built with different metadata, reset it */
        reset_flash_area();
        return false;
    }
    /* Run through the rest of the entries and load them based on type */
    (void) flash_manager_entries_read(&m_flash_manager, NULL, flash_read_callback, NULL);
    /* The storage was valid if there was a local unicast address present */
    return bitfield_get(m_addr_unicast_allocated, 0);
}

bool dsm_has_unflashed_data(void)
{
    for (uint32_t i = 0; i < DSM_ENTRY_TYPES; i++)
    {
        if (!bitfield_is_all_clear(m_flash_groups[i].p_needs_flashing_bitfield, m_flash_groups[i].entry_count))
        {
            return true;
        }
    }
    return false;
}

const void * dsm_flash_area_get(void)
{
#ifdef DSM_FLASH_AREA_LOCATION
    return (const void *) DSM_FLASH_AREA_LOCATION;
#else
    /* Default to putting the area directly before the network flash area */
    return (((const uint8_t *) net_state_flash_area_get()) - (DSM_FLASH_PAGE_COUNT * PAGE_SIZE));
#endif
}

#else
static bool flash_save(dsm_entry_type_t type, uint32_t index)
{
    return true;
}

static bool flash_invalidate(dsm_entry_type_t type, uint32_t index)
{
    return true;
}

bool dsm_flash_config_load(void)
{
    return false;
}
bool dsm_has_unflashed_data(void)
{
    return false;
}

const void * dsm_flash_area_get(void)
{
    return NULL;
}
#endif /* PERSISTENT_STORAGE*/


void dsm_clear(void)
{
#if PERSISTENT_STORAGE
    for (uint32_t i = 0; i < DSM_ENTRY_TYPES; ++i)
    {
        bitfield_clear_all(m_flash_groups[i].p_allocated_bitfield, m_flash_groups[i].entry_count);
        bitfield_clear_all(m_flash_groups[i].p_needs_flashing_bitfield, m_flash_groups[i].entry_count);
    }
#endif

    /* Clear the nonvirtual address storage references */
    for (uint32_t i = 0; i < DSM_NONVIRTUAL_ADDR_MAX; ++i)
    {
        m_addresses[i].subscription_count = 0;
        m_addresses[i].publish_count = 0;
    }
    /* Clear the virtual address storage references */
    for (uint32_t i = 0; i < DSM_VIRTUAL_ADDR_MAX; ++i)
    {
        m_virtual_addresses[i].subscription_count = 0;
        m_virtual_addresses[i].publish_count = 0;
    }

    bitfield_clear_all(m_addr_unicast_allocated, BITFIELD_BLOCK_COUNT(1));
    bitfield_clear_all(m_addr_nonvirtual_allocated, BITFIELD_BLOCK_COUNT(DSM_NONVIRTUAL_ADDR_MAX));
    bitfield_clear_all(m_addr_virtual_allocated, BITFIELD_BLOCK_COUNT(DSM_VIRTUAL_ADDR_MAX));
    bitfield_clear_all(m_subnet_allocated, BITFIELD_BLOCK_COUNT(DSM_SUBNET_MAX));
    bitfield_clear_all(m_appkey_allocated, BITFIELD_BLOCK_COUNT(DSM_APP_MAX));
    bitfield_clear_all(m_devkey_allocated, BITFIELD_BLOCK_COUNT(DSM_DEVICE_MAX));

#if MESH_FEATURE_LPN_ENABLED
    for (uint32_t i = 0; i < ARRAY_SIZE(m_friendships); i++)
    {
        friendship_clear(&m_friendships[i]);
    }
#endif

    m_local_unicast_addr.address_start = NRF_MESH_ADDR_UNASSIGNED;
    m_local_unicast_addr.count = 0;
    m_has_primary_subnet = false;

#if PERSISTENT_STORAGE
    reset_flash_area();
#endif
}


/*****************************************************************************
* Interface functions
*****************************************************************************/

void dsm_init(void)
{
    m_mesh_evt_handler.evt_cb = mesh_evt_handler;
    nrf_mesh_evt_handler_add(&m_mesh_evt_handler);

#if PERSISTENT_STORAGE
    m_flash_mem_listener_update_all.callback = flash_mem_listener_callback;
    m_flash_mem_listener_update_all.p_args = flash_update_all;

    m_flash_is_available = false;
    build_flash_area();
#endif

#if MESH_FEATURE_LPN_ENABLED
    for (uint32_t i = 0; i < ARRAY_SIZE(m_friendships); i++)
    {
        friendship_clear(&m_friendships[i]);
    }
#endif
}

uint32_t dsm_local_unicast_addresses_set(const dsm_local_unicast_address_t * p_address)
{
    NRF_MESH_ASSERT(p_address != NULL);
    if (bitfield_get(m_addr_unicast_allocated, 0))
    {
        return NRF_ERROR_FORBIDDEN;
    }
    else if (p_address->address_start + p_address->count - 1 < p_address->address_start ||
             NRF_MESH_ADDRESS_TYPE_UNICAST != nrf_mesh_address_type_get(p_address->address_start) ||
             NRF_MESH_ADDRESS_TYPE_UNICAST != nrf_mesh_address_type_get(p_address->address_start + p_address->count - 1))
    {
        return NRF_ERROR_INVALID_DATA;
    }
    else
    {
        memcpy(&m_local_unicast_addr, p_address, sizeof(dsm_local_unicast_address_t));
        bitfield_set(m_addr_unicast_allocated, 0);
        (void) flash_save(DSM_ENTRY_TYPE_LOCAL_UNICAST, 0);
        bitfield_set(m_addr_unicast_needs_flashing, 0);
    }

    return NRF_SUCCESS;
}

