NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/access/src/device_state_manager.c
uint32_t dsm_subnet_kr_phase_get(dsm_handle_t subnet_handle, nrf_mesh_key_refresh_phase_t * p_phase)
{
    if (subnet_handle >= DSM_SUBNET_MAX || !bitfield_get(m_subnet_allocated, subnet_handle))
    {
        return NRF_ERROR_NOT_FOUND;
    }
    else
    {
        *p_phase = m_subnets[subnet_handle].key_refresh_phase;
        return NRF_SUCCESS;
    }
}

uint32_t dsm_subnet_update(dsm_handle_t subnet_handle, const uint8_t * p_key)
{
    if (NULL == p_key)
    {
        return NRF_ERROR_NULL;
    }
    else if (subnet_handle >= DSM_SUBNET_MAX || !bitfield_get(m_subnet_allocated, subnet_handle))
    {
        return NRF_ERROR_NOT_FOUND;
    }
    else if (m_subnets[subnet_handle].key_refresh_phase != NRF_MESH_KEY_REFRESH_PHASE_0)
    {
        if (!(m_subnets[subnet_handle].key_refresh_phase == NRF_MESH_KEY_REFRESH_PHASE_1 &&
            memcmp(m_subnets[subnet_handle].root_key_updated, p_key, NRF_MESH_KEY_SIZE) == 0))
        {
            /* Network keys can only be updated if no key refresh is in progress for the new key
             * or Phase 1 for the same key. */
            return NRF_ERROR_INVALID_STATE;
        }
    }
    else
    {
        memcpy(m_subnets[subnet_handle].root_key_updated, p_key, NRF_MESH_KEY_SIZE);
        NRF_MESH_ASSERT(nrf_mesh_keygen_network_secmat(p_key, &m_subnets[subnet_handle].secmat_updated) == NRF_SUCCESS);
        NRF_MESH_ASSERT(NRF_SUCCESS == nrf_mesh_keygen_beacon_secmat(m_subnets[subnet_handle].root_key_updated, &m_subnets[subnet_handle].beacon.info.secmat_updated));

#if MESH_FEATURE_GATT_PROXY_ENABLED
        NRF_MESH_ASSERT(nrf_mesh_keygen_identitykey(
                            p_key, m_subnets[subnet_handle].beacon.info.secmat_updated.identity_key) ==
                        NRF_SUCCESS);
#endif

#if MESH_FEATURE_LPN_ENABLED
        for (uint32_t i = 0; i < ARRAY_SIZE(m_friendships); i++)
        {
            if (m_friendships[i].subnet_handle == subnet_handle)
            {
                uint32_t error = nrf_mesh_keygen_friendship_secmat(p_key,
                                                                   &m_friendships[i].secmat_params,
                                                                   &m_friendships[i].secmat_updated);
                NRF_MESH_ERROR_CHECK(error);
            }
        }
#endif

        m_subnets[subnet_handle].key_refresh_phase = NRF_MESH_KEY_REFRESH_PHASE_1;
        net_state_key_refresh_phase_changed(m_subnets[subnet_handle].net_key_index,
                                            m_subnets[subnet_handle].beacon.info.secmat_updated.net_id,
                                            NRF_MESH_KEY_REFRESH_PHASE_1);

        bitfield_set(m_subnet_needs_flashing, subnet_handle);
        (void) flash_save(DSM_ENTRY_TYPE_SUBNET, subnet_handle);
    }
    return NRF_SUCCESS;
}

uint32_t dsm_subnet_update_swap_keys(dsm_handle_t subnet_handle)
{
    if (subnet_handle >= DSM_SUBNET_MAX || !bitfield_get(m_subnet_allocated, subnet_handle))
    {
        return NRF_ERROR_NOT_FOUND;
    }
    else if (m_subnets[subnet_handle].key_refresh_phase != NRF_MESH_KEY_REFRESH_PHASE_1)
    {
        /* Network keys can only be swapped in key refresh phase 1, */
        /* which will move the procedure to key refresh phase 2.    */
        return NRF_ERROR_INVALID_STATE;
    }
    else
    {
        m_subnets[subnet_handle].key_refresh_phase = NRF_MESH_KEY_REFRESH_PHASE_2;
        net_state_key_refresh_phase_changed(m_subnets[subnet_handle].net_key_index,
                                            m_subnets[subnet_handle].beacon.info.secmat_updated.net_id,
                                            NRF_MESH_KEY_REFRESH_PHASE_2);

        bitfield_set(m_subnet_needs_flashing, subnet_handle);
        (void) flash_save(DSM_ENTRY_TYPE_SUBNET, subnet_handle);
    }

    return NRF_SUCCESS;
}

uint32_t dsm_subnet_update_commit(dsm_handle_t subnet_handle)
{
    if (subnet_handle >= DSM_SUBNET_MAX || !bitfield_get(m_subnet_allocated, subnet_handle))
    {
        return NRF_ERROR_NOT_FOUND;
    }
    else if (m_subnets[subnet_handle].key_refresh_phase != NRF_MESH_KEY_REFRESH_PHASE_0)
    {
        memcpy(m_subnets[subnet_handle].root_key, m_subnets[subnet_handle].root_key_updated, NRF_MESH_KEY_SIZE);
        memcpy(&m_subnets[subnet_handle].secmat, &m_subnets[subnet_handle].secmat_updated, sizeof(m_subnets[subnet_handle].secmat));
        memcpy(&m_subnets[subnet_handle].beacon.info.secmat, &m_subnets[subnet_handle].beacon.info.secmat_updated,
                sizeof(m_subnets[subnet_handle].beacon.info.secmat));

#if MESH_FEATURE_LPN_ENABLED
        for (uint32_t i = 0; i < ARRAY_SIZE(m_friendships); i++)
        {
            if (m_friendships[i].subnet_handle == subnet_handle)
            {
                memcpy(&m_friendships[i].secmat, &m_friendships[i].secmat_updated, sizeof(m_friendships[i].secmat));
            }
        }
#endif

        m_subnets[subnet_handle].key_refresh_phase = NRF_MESH_KEY_REFRESH_PHASE_0;
        net_state_key_refresh_phase_changed(m_subnets[subnet_handle].net_key_index,
                                            m_subnets[subnet_handle].beacon.info.secmat.net_id,
                                            NRF_MESH_KEY_REFRESH_PHASE_0);

        /* Commit changes to application keys: */
        for (uint32_t i = 0; i < DSM_APP_MAX; i++)
        {
            if (bitfield_get(m_appkey_allocated, i)
                    && m_appkeys[i].subnet_handle == subnet_handle
                    && m_appkeys[i].key_updated)
            {
                memcpy(&m_appkeys[i].secmat, &m_appkeys[i].secmat_updated, sizeof(nrf_mesh_application_secmat_t));
                m_appkeys[i].key_updated = false;

                bitfield_set(m_appkey_needs_flashing, i);
                (void) flash_save(DSM_ENTRY_TYPE_APPKEY, i);
            }
        }

        bitfield_set(m_subnet_needs_flashing, subnet_handle);
        (void) flash_save(DSM_ENTRY_TYPE_SUBNET, subnet_handle);
        return NRF_SUCCESS;
    }

