NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/access/src/device_state_manager.c
        m_appkeys[app_handle].key_updated = true;
        memcpy(m_appkeys[app_handle].secmat_updated.key, p_key, NRF_MESH_KEY_SIZE);
        NRF_MESH_ASSERT(nrf_mesh_keygen_aid(p_key, &m_appkeys[app_handle].secmat_updated.aid) == NRF_SUCCESS);
        m_appkeys[app_handle].secmat_updated.is_device_key = m_appkeys[app_handle].secmat.is_device_key;

        bitfield_set(m_appkey_needs_flashing, app_handle);
        (void) flash_save(DSM_ENTRY_TYPE_APPKEY, app_handle);
    }
    return NRF_SUCCESS;
}

uint32_t dsm_appkey_delete(dsm_handle_t app_handle)
{
    if (app_handle >= DSM_APP_MAX || !bitfield_get(m_appkey_allocated, app_handle))
    {
        return NRF_ERROR_NOT_FOUND;
    }
    else
    {
        bitfield_clear(m_appkey_allocated, app_handle);
        (void) flash_invalidate(DSM_ENTRY_TYPE_APPKEY, app_handle);
        return NRF_SUCCESS;
    }
}

uint32_t dsm_appkey_get_all(dsm_handle_t subnet_handle, mesh_key_index_t * p_key_list, uint32_t * p_count)
{
    if (NULL == p_key_list || NULL == p_count )
    {
        return NRF_ERROR_NULL;
    }
    else if (subnet_handle >= DSM_SUBNET_MAX || !bitfield_get(m_subnet_allocated, subnet_handle))
    {
        return NRF_ERROR_NOT_FOUND;
    }
    else if (!get_all_appkeys(subnet_handle, p_key_list, p_count))
    {
        return NRF_ERROR_INVALID_LENGTH;
    }
    else
    {
        return NRF_SUCCESS;
    }
}

uint32_t dsm_tx_secmat_get(dsm_handle_t subnet_handle, dsm_handle_t app_handle, nrf_mesh_secmat_t * p_secmat)
{
    if (NULL == p_secmat)
    {
        return NRF_ERROR_NULL;
    }

    uint32_t status = app_tx_secmat_get(app_handle, &subnet_handle, &p_secmat->p_app);
    if (NRF_SUCCESS != status)
    {
        return status;
    }

    /* Use updated network security credentials during key refresh phase 2: */
    p_secmat->p_net = m_subnets[subnet_handle].key_refresh_phase == NRF_MESH_KEY_REFRESH_PHASE_2 ?
            &m_subnets[subnet_handle].secmat_updated : &m_subnets[subnet_handle].secmat;

    return NRF_SUCCESS;
}

#if MESH_FEATURE_LPN_ENABLED
uint32_t dsm_tx_friendship_secmat_get(dsm_handle_t subnet_handle, dsm_handle_t app_handle, nrf_mesh_secmat_t * p_secmat)
{
    if (NULL == p_secmat)
    {
        return NRF_ERROR_NULL;
    }

    uint32_t error = app_tx_secmat_get(app_handle, &subnet_handle, &p_secmat->p_app);
    if (NRF_SUCCESS != error)
    {
        return error;
    }

    for (uint32_t i = 0; i < ARRAY_SIZE(m_friendships); i++)
    {
        if (m_friendships[i].subnet_handle == subnet_handle)
        {
            /* Use updated network security credentials during key refresh phase 2: */
            p_secmat->p_net = m_subnets[subnet_handle].key_refresh_phase == NRF_MESH_KEY_REFRESH_PHASE_2 ?
                        &m_friendships[i].secmat_updated : &m_friendships[i].secmat;

            return NRF_SUCCESS;
        }
    }

    return NRF_ERROR_NOT_FOUND;
}
#endif

uint32_t dsm_beacon_info_get(dsm_handle_t subnet_handle, const nrf_mesh_beacon_info_t ** pp_beacon_info)
{
    if (pp_beacon_info == NULL)
    {
        return NRF_ERROR_NULL;
    }
    else if (subnet_handle >= DSM_SUBNET_MAX || !bitfield_get(m_subnet_allocated, subnet_handle) )
    {
        return NRF_ERROR_NOT_FOUND;
    }
    else
    {
        *pp_beacon_info = &m_subnets[subnet_handle].beacon.info;
        return NRF_SUCCESS;
    }
}

uint32_t dsm_net_secmat_from_keyindex_get(mesh_key_index_t net_key_index, const nrf_mesh_network_secmat_t ** pp_net)
{
    dsm_handle_t subnet_handle = dsm_net_key_index_to_subnet_handle(net_key_index);

    if (pp_net == NULL)
    {
        return NRF_ERROR_NULL;
    }
    else if (subnet_handle >= DSM_SUBNET_MAX || !bitfield_get(m_subnet_allocated, subnet_handle) )
    {
        return NRF_ERROR_NOT_FOUND;
    }
    else
    {
        *pp_net = &m_subnets[subnet_handle].secmat;
        return NRF_SUCCESS;
    }
}


/************************************** Externed functions ****************************************/

/* returns null via pp_secmat if end of search */
void nrf_mesh_net_secmat_next_get(uint8_t nid, const nrf_mesh_network_secmat_t ** pp_secmat, const nrf_mesh_network_secmat_t ** pp_secmat_secondary)
{
    NRF_MESH_ASSERT(NULL != pp_secmat);
    NRF_MESH_ASSERT(NULL != pp_secmat_secondary);

    nid &= PACKET_MESH_NET_NID_MASK;

#if MESH_FEATURE_LPN_ENABLED
    uint32_t j = 0;
    if (*pp_secmat != NULL)
    {
        /* Find pp_secmat in friendships and go to the next one */
        j = friendship_index_by_secmat_get(*pp_secmat) + 1;
    }

    for (; j < ARRAY_SIZE(m_friendships); j++)
    {
        if (m_friendships[j].subnet_handle != DSM_HANDLE_INVALID)
        {
            if (get_net_secmat_by_nid(m_friendships[j].subnet_handle, nid,
                                      &m_friendships[j].secmat, &m_friendships[j].secmat_updated,
                                      pp_secmat, pp_secmat_secondary))
            {
                return;
            }
        }
    }
#endif

    dsm_handle_t i = 0;
    if (*pp_secmat != NULL)
    {
        dsm_handle_t prev = get_subnet_handle(*pp_secmat);
        i = (prev == DSM_HANDLE_INVALID) ? 0 : prev + 1;
    }

    *pp_secmat = NULL;
    *pp_secmat_secondary = NULL;

    for (; i < DSM_SUBNET_MAX; i++)
    {
        if (get_net_secmat_by_nid(i, nid,
                                  &m_subnets[i].secmat, &m_subnets[i].secmat_updated,
                                  pp_secmat, pp_secmat_secondary))
        {
            break;
        }
    }
}

/* returns null via pp_app_secmat if end of search */
void nrf_mesh_app_secmat_next_get(const nrf_mesh_network_secmat_t * p_network_secmat, uint8_t aid, const nrf_mesh_application_secmat_t ** pp_app_secmat)
{
    NRF_MESH_ASSERT(NULL != pp_app_secmat);
    NRF_MESH_ASSERT(NULL != p_network_secmat);

    dsm_handle_t subnet_handle = dsm_subnet_handle_get(p_network_secmat);
    if (subnet_handle == DSM_HANDLE_INVALID)
    {
        *pp_app_secmat = NULL;
    }
    else
    {
        get_app_secmat(subnet_handle,aid, pp_app_secmat);
    }
}

void nrf_mesh_devkey_secmat_get(uint16_t owner_addr, const nrf_mesh_application_secmat_t ** pp_app_secmat)
{
    NRF_MESH_ASSERT(NULL != pp_app_secmat);
    *pp_app_secmat = get_devkey_secmat(owner_addr);
}

