NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/access/src/device_state_manager.c
void nrf_mesh_primary_net_secmat_get(uint16_t owner_addr, const nrf_mesh_network_secmat_t ** pp_secmat)
{
    dsm_handle_t devkey_handle;
    dsm_handle_t netkey_handle;
    nrf_mesh_secmat_t secmat;

    NRF_MESH_ASSERT(NULL != pp_secmat);
    *pp_secmat = NULL;

    if (NRF_SUCCESS != dsm_devkey_handle_get(owner_addr, &devkey_handle))
    {
        return;
    }

    if (NRF_SUCCESS != dsm_appkey_handle_to_subnet_handle(devkey_handle, &netkey_handle))
    {
        return;
    }

    if (NRF_SUCCESS != dsm_tx_secmat_get(netkey_handle, devkey_handle, &secmat))
    {
        return;
    }

    *pp_secmat = secmat.p_net;
}

void nrf_mesh_beacon_info_next_get(const uint8_t * p_network_id, const nrf_mesh_beacon_info_t ** pp_beacon_info,
        nrf_mesh_key_refresh_phase_t * p_kr_phase)
{
    NRF_MESH_ASSERT(NULL != pp_beacon_info);
    NRF_MESH_ASSERT(NULL != p_kr_phase);

    uint32_t i = 0;
    if (*pp_beacon_info != NULL)
    {
        /* Iterate over the proceeding elements */
        i = get_subnet_handle_by_beacon_info(*pp_beacon_info) + 1;
    }
    for (; i < DSM_SUBNET_MAX; i++)
    {
        if (bitfield_get(m_subnet_allocated, i))
        {
            bool valid_beacon_info = false;
            if (m_subnets[i].key_refresh_phase == NRF_MESH_KEY_REFRESH_PHASE_0)
            {
                valid_beacon_info = p_network_id == NULL
                    || memcmp(p_network_id, m_subnets[i].beacon.info.secmat.net_id, NRF_MESH_NETID_SIZE) == 0;
            }
            else
            {
                valid_beacon_info = p_network_id == NULL
                    || memcmp(p_network_id, m_subnets[i].beacon.info.secmat.net_id, NRF_MESH_NETID_SIZE) == 0
                    || memcmp(p_network_id, m_subnets[i].beacon.info.secmat_updated.net_id, NRF_MESH_NETID_SIZE) == 0;
            }

            if (valid_beacon_info)
            {
                /* Update the iv_update_permitted flag, in case we've added the
                 * primary subnetwork since the last access to this struct. If we
                 * are part of the primary subnet, that's the only subnet that can
                 * initiate an IV update. */
                m_subnets[i].beacon.info.iv_update_permitted =
                    (!m_has_primary_subnet ||
                     m_subnets[i].net_key_index == PRIMARY_SUBNET_INDEX);

                *pp_beacon_info = &m_subnets[i].beacon.info;
                *p_kr_phase = m_subnets[i].key_refresh_phase;
                return;
            }
        }
    }
    *pp_beacon_info = NULL;
}

bool nrf_mesh_rx_address_get(uint16_t raw_address, nrf_mesh_address_t * p_address)
{
    nrf_mesh_address_type_t type = nrf_mesh_address_type_get(raw_address);
    bool rx_addr_exists = false;
    switch (type)
    {
        case NRF_MESH_ADDRESS_TYPE_UNICAST:
            rx_addr_exists = rx_unicast_address_get(raw_address, p_address);
            break;
        case NRF_MESH_ADDRESS_TYPE_GROUP:
            rx_addr_exists = rx_group_address_get(raw_address, p_address);
            break;
        case NRF_MESH_ADDRESS_TYPE_VIRTUAL:
            rx_addr_exists = rx_virtual_address_get(raw_address, p_address);
            break;
        default:
            break;
    }
    return rx_addr_exists;
}


void nrf_mesh_unicast_address_get(uint16_t * p_addr_start, uint16_t * p_addr_count)
{
    NRF_MESH_ASSERT(p_addr_start && p_addr_count);
    *p_addr_start = m_local_unicast_addr.address_start;
    *p_addr_count = m_local_unicast_addr.count;
}

#if MESH_FEATURE_LPN_ENABLED
uint32_t nrf_mesh_friendship_secmat_params_set(const nrf_mesh_network_secmat_t * p_net, const nrf_mesh_keygen_friendship_secmat_params_t *p_secmat_params)
{
    if (NULL == p_net || NULL == p_secmat_params)
    {
        return NRF_ERROR_NULL;
    }

    dsm_handle_t subnet_handle = get_subnet_handle(p_net);

    if (DSM_HANDLE_INVALID == subnet_handle)
    {
        return NRF_ERROR_NOT_FOUND;
    }

    uint32_t fs_subnet;
    for (fs_subnet = 0; fs_subnet < ARRAY_SIZE(m_friendships); fs_subnet++)
    {
        if (m_friendships[fs_subnet].subnet_handle == DSM_HANDLE_INVALID)
        {
            break;
        }
    }

    if (ARRAY_SIZE(m_friendships) == fs_subnet)
    {
        return NRF_ERROR_NO_MEM;
    }

    m_friendships[fs_subnet].subnet_handle = subnet_handle;
    m_friendships[fs_subnet].secmat_params = *p_secmat_params;

    if (m_subnets[subnet_handle].key_refresh_phase == NRF_MESH_KEY_REFRESH_PHASE_0)
    {
        uint32_t error = nrf_mesh_keygen_friendship_secmat(m_subnets[subnet_handle].root_key,
                                                           &m_friendships[fs_subnet].secmat_params,
                                                           &m_friendships[fs_subnet].secmat);
        NRF_MESH_ERROR_CHECK(error);
    }
    else
    {
        uint32_t error = nrf_mesh_keygen_friendship_secmat(m_subnets[subnet_handle].root_key_updated,
                                                           &m_friendships[fs_subnet].secmat_params,
                                                           &m_friendships[fs_subnet].secmat_updated);
        NRF_MESH_ERROR_CHECK(error);
    }

    return NRF_SUCCESS;
}

void nrf_mesh_friendship_secmat_get(uint16_t lpn_addr, const nrf_mesh_network_secmat_t ** pp_secmat)
{
    NRF_MESH_ASSERT(NULL != pp_secmat);
    *pp_secmat = NULL;

    for (uint32_t count = 0; count < ARRAY_SIZE(m_friendships); count++)
    {
        if (m_friendships[count].subnet_handle != DSM_HANDLE_INVALID &&
            m_friendships[count].secmat_params.lpn_address == lpn_addr)
        {
            /* Use updated network security credentials during key refresh phase 2: */
            *pp_secmat = m_subnets[m_friendships[count].subnet_handle].key_refresh_phase == NRF_MESH_KEY_REFRESH_PHASE_2 ?
                    &m_friendships[count].secmat_updated : &m_friendships[count].secmat;
            break;
        }
    }
}
#endif
